{
  "Id": "295",
  "Name": "Issue 295",
  "UpdatedTimeStamp": "2021-02-06T02:47:09Z",
  "Summary": "No Edition Summary",
  "Introduction": "Happy Friday! Another great week of content and a big thanks to Luce for curating most of these articles. If you want to know more about the Xamarin Community Toolkit there are some great links this week, as well as a review of the new Apple Macbook Pro just in case you have too much money. Hope you have a lovely weekend, ❤ Kym",
  "PublishDate": "2021-02-06T02:47:04Z",
  "Curators": "Kym Phillpotts",
  "Articles": [
    {
      "Title": "The New .NET Multi-platform App UI",
      "Url": "https://devblogs.microsoft.com/xamarin/the-new-net-multi-platform-app-ui-maui/",
      "Description": ".NET MAUI coming in .NET 6 is still a big talking point, we are forever wanting updates on what is happening and when so I too was excited to read this post this week!",
      "EditionId": "295",
      "Author": "David Ortinau",
      "Id": "295-1",
      "Category": "NEWS"
    },
    {
      "Title": "Review of Apple Macbook Pro M1",
      "Url": "https://danielhindrikes.se/index.php/2021/02/01/review-of-apple-macbook-pro-m1/",
      "Description": "I know a lot of developers who have their eyes on the new Apple Macbook M1 devices. Daniel gives his review of the machine as a Xamarin development machine. Should you buy one? I don't know. Should you buy me one? Absolutely.",
      "EditionId": "295",
      "Author": "Daniel Hindrikes",
      "Id": "295-2",
      "Category": "TOOLS"
    },
    {
      "Title": "Xamarin.Forms UI/UX Challenges - Micuna Food - Part1",
      "Url": "https://danielmonettelli.github.io/posts/xamarin-forms-ui-ux-challenges-micuna-food_part1/",
      "Description": "Who doesn't love a good UI challenge? I always enjoy seeing how beautiful UI apps can be recreated in Xamarin.Forms. This first in a series post from Daniel is excellent, with it doing a good job of breaking down how a layout and UI structure is identified from the parts of an existing design.",
      "EditionId": "295",
      "Author": "Daniel Monettelli",
      "Id": "295-3",
      "Category": "XAMARIN FORMS"
    },
    {
      "Title": "Xamarin Community Toolkit and Windows",
      "Url": "https://blog.verslu.is/xamarin/xamarin-communitytoolkit/build-xamarin-communitytoolkit-sample-app-windows/",
      "Description": "If you want to try out the Xamarin.CommunityToolkit sample app on Windows you might find some hurdles building and running it. Here Gerald shares some things you might encounter and how to fix them.",
      "EditionId": "295",
      "Author": "Gerald Versluis",
      "Id": "295-4",
      "Category": "XAMARIN FORMS"
    },
    {
      "Title": "Using styles on custom UserControls",
      "Url": "https://www.banditoth.hu/2021/02/05/xamarin-forms-using-styles-on-custom-usercontrols/",
      "Description": "Quick tip on how to use styles when you create your own custom UserControls.",
      "EditionId": "295",
      "Author": "András Tóth",
      "Id": "295-5",
      "Category": "XAMARIN FORMS"
    },
    {
      "Title": "Templated Controls are Awesome | The Xamarin Show",
      "Url": "https://channel9.msdn.com/Shows/XamarinShow/Templated-Controls-are-Awesome--The-Xamarin-Show",
      "Description": "This week, James is joined again by Javier Suárez, Developer on Xamarin.Forms, who explains what control templates are, why they are awesome, and how you can create amazing things with them. You don't want to miss this one!",
      "EditionId": "295",
      "Author": "The Xamarin Show",
      "Id": "295-6",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Xamarin Community Standup - Community Toolkit updates with Gerald Versluis!",
      "Url": "https://www.youtube.com/watch?v=cNw7ZxZKxeU",
      "Description": "It's the time again, Xamarin Community Standup week! This week, they were joined by Gerald Versluis, one of our favourite people in the community!Lots of awesome updates, blogs and of course, talk of the snazzy Xamarin Community Toolkit!",
      "EditionId": "295",
      "Author": "Xamarin Developers",
      "Id": "295-7",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Xamarin Community Toolkit: TabView",
      "Url": "https://channel9.msdn.com/Shows/XamarinShow/Xamarin-Community-Toolkit-TabView",
      "Description": "In this episode of the Xamarin Show we're talking about the much anticipated TabView. The TabView is now included inside of the Xamarin Community Toolkit and I have Javier on, who has worked on this, to show us what it's all about. Swiping between tabs, customizing the looks, styling it any way you want, all that and much more can be done with the flexible TabView. Make sure to tune in!",
      "EditionId": "295",
      "Author": "The Xamarin Show",
      "Id": "295-8",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Live Stream: Building a Peloton Clone with Xamarin.Forms Part 4 - TabView",
      "Url": "https://www.youtube.com/watch?v=WPT8LZCE4Pw",
      "Description": "James continues his live streams, working on the Peloton app clone with Xamarin.Forms. This week's recording has him adding TabView from the Community Toolkit to streamline top tabs.",
      "EditionId": "295",
      "Author": "James Montemagno",
      "Id": "295-9",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Overcoming Common Upgrade Issues - Xamarin.Forms 3.0 to 5.0",
      "Url": "https://www.youtube.com/watch?v=zy4iJqEsCSo",
      "Description": "Ever gone to update an old app to more recent packages, including Xamarin.Forms and found issues? I sure have! In this video, David shows some of the steps to upgrade including how to solve some of the errors that come up! :)",
      "EditionId": "295",
      "Author": "David Ortinau",
      "Id": "295-10",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Merge Conflict: 239: Planning an App Release",
      "Url": "https://www.mergeconflict.fm/239",
      "Description": "It is now Franks' turn to get his next app into the app store. We look back at what went into its creation, his choices for monetization, and thoughts on what needs to happen leading up to the main release.",
      "EditionId": "295",
      "Author": "Merge Conflict",
      "Id": "295-11",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Add a Loading with StateViews from the Xamarin Community Toolkit",
      "Url": "https://www.youtube.com/watch?v=Ou7IZ7yZgKc",
      "Description": "We use lists of data a lot in our apps, so one scenario that crops up a lot is how to show that data is being fetched from the web to populate the list. By default, it just looks blank which can confuse users. In this video, David shows you how you can use Xamarin Community Toolkit's StateViews, you can have a helpful loading screen to inform users, neat!",
      "EditionId": "295",
      "Author": "David Ortinau",
      "Id": "295-12",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Using MessagingCenter in Xamarin.Forms",
      "Url": "https://www.youtube.com/watch?v=JyiL6W-fvEs",
      "Description": "Good architecture of your code is important and one example of this is loose coupling. Did you know that Xamarin comes with a messaging centre out of the box to help support this loose coupling between classes? Gerald teaches us all about it in this video.",
      "EditionId": "295",
      "Author": "Gerald Versluis",
      "Id": "295-13",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Null Points 38: Resiliency In Mobile Apps",
      "Url": "https://nullpointers.io/38/",
      "Description": "Nobody likes a crashing app! In this week's Null Pointers, the group discuss things you might want to think about to help improve the resiliency of your apps!",
      "EditionId": "295",
      "Author": "Null Pointers",
      "Id": "295-14",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Everything you need to know about ListView",
      "Url": "https://www.youtube.com/watch?v=VzFqQv8YJNM",
      "Description": "James goes deep on the ListView including displaying lists of data, grouped data, header, footers, context actions, and even pull-to-refresh.",
      "EditionId": "295",
      "Author": "James Montemagno",
      "Id": "295-15",
      "Category": "PODCASTS & VIDEOS"
    },
    {
      "Title": "Input Validation Scenarios with Xamarin.CommunityToolkit",
      "Url": "https://www.youtube.com/watch?v=ZDUWWeAg8PI",
      "Description": "In this video we will see how to check the validity of a MultiValidationBehavior and EmailValidationBehavior by the press of a button and show the right error messages and how to do it the more MVVM way with data-binding.",
      "EditionId": "295",
      "Author": "Gerald Versluis",
      "Id": "295-16",
      "Category": "PODCASTS & VIDEOS"
    }
  ]
}